import { WingBlank, WhiteSpace, Flex } from '@td-design/react-native';
import { Container, Text } from 'components';
import { ScrollView } from 'react-native';

export function Privacy() {
  return (
    <Container>
      <ScrollView>
        <WingBlank>
          <WhiteSpace />
          <Flex justifyContent="center">
            <Text variant="h1">晋日达隐私政策</Text>
          </Flex>
          <WhiteSpace />
          <Text>更新日期：2018年11月01日</Text>
          <WhiteSpace />
          <Text>生效日期：2018年11月01日</Text>
          <WhiteSpace />
          <Text>
            晋日达（“我们”）非常重视用户的隐私和个人信息保护。您在使用我们的产品与/或服务时，我们可能会收集和使用您的相关信息。我们希望通过《晋日达隐私政策》（“本隐私政策”）向您说明我们在您使用我们的产品与/或服务时如何收集、使用、保存、共享和转让这些信息，以及我们为您提供的访问、更新、删除和保护这些信息的方式。
          </Text>
          <WhiteSpace />
          <Text>
            如果您不同意本隐私政策，我们无法为您提供完整的产品和服务，您也可以选择停止使用。当您选择继续或再次使用时，基于提供产品和服务所必需，将视为您接受和认可我们按照本政策对您的相关信息进行处理。
          </Text>
          <WhiteSpace />
          <Text>
            我们非常重视用户个人信息的保护，并且将以勤勉和审慎的义务对待这些信息。您在下载、安装、开启、浏览、注册、登录、使用（以下统称“使用”）“晋日达”软件及相关服务时，我们将按照本《隐私政策》收集、保存、使用、共享、披露及保护您的个人信息。我们希望通过本《隐私政策》向您介绍我们对您个人信息的处理方式，因此我们建议您认真完整地阅读本《隐私政策》的所有条款。
          </Text>
          <WhiteSpace />
          <Text>本隐私政策旨在帮助您了解以下内容：</Text>
          <WhiteSpace />
          <Text>一、我们如何收集和使用个人信息</Text>
          <Text>二、我们如何使用Cookie和同类技术</Text>
          <Text>二、我们如何使用Cookie和同类技术</Text>
          <Text>四、我们如何共享、转让、公开披露个人信息</Text>
          <Text>五、我们如何保护个人信息的安全</Text>
          <Text>六、您如何管理您的个人信息</Text>
          <Text>七、我们如何处理未成年人个人信息</Text>
          <Text>八、隐私政策的修订和通知</Text>
          <Text>九、适用范围</Text>
          <Text>十、如何联系我们</Text>
          <Text>十一、其他</Text>
          <WhiteSpace />
          <Text>一、我们如何收集和使用个人信息</Text>
          <WhiteSpace />
          <Text>
            在您使用“晋日达”软件及服务的过程中，我们将根据合法、正当、必要的原则，收集信息。我们收集或请您提供的信息将用于：
          </Text>
          <WhiteSpace />
          <Text>1.保障产品的基础正常运行；</Text>
          <WhiteSpace />
          <Text>2.实现各项功能和服务；</Text>
          <WhiteSpace />
          <Text>3.优化、改善产品和服务；</Text>
          <WhiteSpace />
          <Text>4.保障产品、服务以及用户使用安全；</Text>
          <WhiteSpace />
          <Text>5.遵循法律法规与国家标准的规定。</Text>
          <WhiteSpace />
          <Text>（一）我们直接收集与使用的个人信息</Text>
          <WhiteSpace />
          <Text>
            我们会按照如下方式收集您在使用服务时主动提供的，以及通过自动化手段收集您在使用功能或接受服务过程中产生的信息：
          </Text>
          <WhiteSpace />
          <Text>1.保障“晋日达”和服务的正常运行</Text>
          <WhiteSpace />
          <Text>
            当您使用“晋日达”及相关服务时，为了保障软件与服务的正常运行，我们会收集您的硬件型号、操作系统版本号、国际移动设备识别码（IMEI）、网络设备硬件地址（MAC）、IP地址、软件版本号、网络接入方式及类型、操作日志等信息。请您了解，这些信息是我们提供服务和保障产品正常运行所必须收集的基本信息。
          </Text>
          <WhiteSpace />
          <Text>
            当您使用“晋日达”及相关服务时，为了保障软件与服务的正常运行，我们会收集您的硬件型号、操作系统版本号、国际移动设备识别码（IMEI）、网络设备硬件地址（MAC）、IP地址、软件版本号、网络接入方式及类型、操作日志等信息。请您了解，这些信息是我们提供服务和保障产品正常运行所必须收集的基本信息。
          </Text>
          <WhiteSpace />
          <Text>
            （1）当您注册、登录“晋日达”及相关服务时，您可以通过手机号创建账号，我们将通过发送短信验证码来验证您的身份是否有效，并且您可完善相关的网络身份识别信息（如头像、昵称和密码），收集这些信息是为了帮助您完成注册。您还可根据自身需求选择填写性别、生日、地区及介绍等信息完善您的个人信息。
          </Text>
          <WhiteSpace />
          <Text>
            （2）您也可以使用第三方账号（如微信、QQ、微博账号等）登录进入“晋日达”，您此时将授权我们获取您在第三方平台注册的公开信息（头像、昵称等），并在您同意本隐私政策后将您的第三方账号与您的“晋日达”账户绑定，使您可以通过第三方账号直接登录并使用本产品和相关服务。
          </Text>
          <WhiteSpace />
          <Text>
            （3）在您使用钱包、银行卡、支付等需进行身份认证的功能或服务时，根据中华人民共和国相关法律法规，您可能需要提供您的真实身份信息（真实姓名、身份证号码、电话号码等）以完成实名验证。如您不提供这些信息，您将不能使用钱包、银行卡、支付功能，但您可以继续使用“晋日达”的其他服务。这些信息属于个人敏感信息，我们将采用行业内通行的方式及尽最大的商业努力来保护您个人敏感信息的安全。如果您不提供这些信息，您将可能无法获得相关服务，但不影响“晋日达”其他功能与服务的正常使用。
          </Text>
          <WhiteSpace />
          <Text>3.帮助您购买、查询、使用电站财产</Text>
          <WhiteSpace />
          <Text>
            为了方便您查询电站资产，并尽量降低可能存在的风险，“账单明细”会记录购买电站、转让电站、红包、提现与电费的使用情况。
          </Text>
          <WhiteSpace />
          <Text>这些信息是您使用“钱包”功能所必需，拒绝提供会使您无法使用钱包功能，但不影响您正常使用其他功能。</Text>
          <WhiteSpace />
          <Text>4.开展营销活动</Text>
          <WhiteSpace />
          <Text>
            当您选择参加我们举办的有关营销活动时，根据活动需要您可提供姓名、通信地址、联系方式、银行账号等信息。这些信息中可能包含个人敏感信息（如个人电话号码、银行账号等），是您收到转账或者礼品所必要的，如果您拒绝提供这些信息，我们将可能无法向您转账或发放礼品。
          </Text>
          <WhiteSpace />
          <Text>5.保障产品、服务及用户使用安全</Text>
          <WhiteSpace />
          <Text>
            为帮助我们更好地了解“晋日达”及相关服务的运行情况，以便确保运行与提供服务的安全，我们可能记录网络日志信息，以及使用软件及相关服务的频率、崩溃数据、总体安装、使用情况、性能数据等信息。
          </Text>
          <WhiteSpace />
          <Text>（二）我们可能从第三方获得的您的个人信息</Text>
          <WhiteSpace />
          <Text>（二）我们可能从第三方获得的您的个人信息  </Text>
          <Text>
            1.基于我们与通信运营商的合作，当您使用“晋日达”“验证码登录”功能时，经过您的明示同意，您使用的手机号码的运营商将您的手机号码发送给我们，便于我们为您提供快捷的登录服务。如您不选择“验证码登录”，您还可以使用其他登录方式，如密码登录、第三方账号登录等。手机号码数据敏感个人信息，您有权拒绝提供，但这会将使得您无法使用“验证码登录”方式注册登录“晋日达”，但不影响您通过其他方式注册登录，也不影响其他功能的正常使用。
          </Text>
          <WhiteSpace />
          <Text>2.当您主动使用第三方账号登录“晋日达”时，我们会收集第三方账号的昵称、头像等信息。  </Text>
          <WhiteSpace />
          <Text>
            3.用户因使用我们的产品或者服务而被我们收集的信息，例如其他用户发布的信息中可能含有您的部分信息（如：投诉建议、商务合作中涉及到与您相关的信息）。
          </Text>
          <WhiteSpace />
          <Text>
            4.在您使用“晋日达”软件及相关服务提供的身份认证功能时，我们会根据相关法律法规规定和/或该身份认证功能（例如：芝麻认证）所必需，我们将采用行业内通行的方式及尽最大的商业努力来保护您个人敏感信息的安全。如果您不提供这些信息，您将可能无法获得相关服务。
          </Text>
          <WhiteSpace />
          <Text>（三）收集、使用个人信息目的变更的处理</Text>
          <WhiteSpace />
          <Text>
            请您了解，随着我们业务的发展，可能会对“晋日达”的功能和提供的服务有所调整变化。当新功能或服务需要收集、使用您的个人信息，会再次进行告知，并征得您的同意。
          </Text>
          <WhiteSpace />
          <Text>（四）依法豁免征得同意收集和使用的个人信息</Text>
          <WhiteSpace />
          <Text>
            请您理解，在下列情形中，根据法律法规及相关国家标准，我们收集和使用您的个人信息无需征得您的授权同意{' '}
          </Text>
          <WhiteSpace />
          <Text>（1）与国家安全、国防安全直接相关的； （2）与公共安全、公共卫生、重大公共利益直接相关的；</Text>
          <WhiteSpace />
          <Text>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的；</Text>
          <WhiteSpace />
          <Text>（4）出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；</Text>
          <WhiteSpace />
          <Text>（5）所收集的您的个人信息是您自行向社会公众公开的；</Text>
          <WhiteSpace />
          <Text>（6）从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道；</Text>
          <WhiteSpace />
          <Text>（7）根据您的要求签订或履行合同所必需的；</Text>
          <WhiteSpace />
          <Text>
            （8）用于维护“晋日达”软件及相关服务的安全稳定运行所必需的，例如发现、处置“晋日达”软件及相关服务的故障；
          </Text>
          <WhiteSpace />
          <Text>（9）为合法的新闻报道所必需的；</Text>
          <WhiteSpace />
          <Text>
            （10）学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
          </Text>
          <WhiteSpace />
          <Text>（11）法律法规规定的其他情形。</Text>
          <WhiteSpace />
          <Text>
            特别提示您注意，如信息无法单独或结合其他信息识别到您的个人身份，其不属于法律意义上您的个人信息；当您的信息可以单独或结合其他信息识别到您的个人身份时或我们将无法与任何特定个人信息建立联系的数据与其他您的个人信息结合使用时，则在结合使用期间，这些信息将作为您的个人信息按照本隐私政策处理与保护。
          </Text>
          <WhiteSpace />
          <Text>二、对Cookie和同类技术的使用</Text>
          <WhiteSpace />
          <Text>
            Cookie和同类技术是互联网中的通用常用技术。当您使用“晋日达”软件及相关服务时，我们可能会使用相关技术向您的设备发送一个或多个Cookie或匿名标识符，以收集和存储您访问、使用本产品时的信息。我们使用Cookie和同类技术主要为了实现以下功能或服务；
          </Text>
          <WhiteSpace />
          <Text>（一）保障产品与服务的安全、高效运转</Text>
          <WhiteSpace />
          <Text>
            我们可能会设置认证与保障安全性的cookie或匿名标识符，使我们确认您是否安全登录服务，或者是否遇到盗用、欺诈等不法行为。这些技术还会帮助我们改进服务效率，提升登录和响应速度。
          </Text>
          <WhiteSpace />
          <Text>（二）帮助您获得更轻松的访问体验</Text>
          <WhiteSpace />
          <Text>
            使用此类技术可以帮助您省去重复您填写个人信息、输入搜索内容的步骤和流程（例如：实现登录流程、记录搜索历史）。
          </Text>
          <WhiteSpace />
          <Text>（三）为您推荐、展示、推送您可能感兴趣的内容或账号</Text>
          <WhiteSpace />
          <Text>
            我们可能会利用Cookie和同类技术（例如Beacon、Proxy等技术）了解您的偏好和使用习惯，进行咨询或数据分析，以改善产品服务及用户体验，并优化您对广告的选择。
          </Text>
          <WhiteSpace />
          <Text>我们承诺，我们不会将Cookie用于本隐私政策所述目的之外的任何其他用途。   三、我们如何存储个人信息</Text>
          <WhiteSpace />
          <Text>（一）信息存储的地点</Text>
          <WhiteSpace />
          <Text>
            我们依照法律法规的规定，将在运营过程中收集和产生的您的个人信息存储于中华人民共和国境内。目前，我们不会将上述信息传输至境外，如果我们向境外传输，我们将会遵循国家相关规定，征求您的同意。
          </Text>
          <WhiteSpace />
          <Text>（二）存储期限</Text>
          <WhiteSpace />
          <Text>
            我们仅在为提供“晋日达”及服务之目的所必需的期间内保留您的个人信息，例如，您发布的评论、点赞、投诉建议等信息，在您未撤回、删除或未注销账号期间，我们会保留相关信息。超出必要期限后，我们将对您的个人信息进行删除或匿名化处理，但法律法规另有规定的除外。
          </Text>
          <WhiteSpace />
          <Text>四、我们如何共享、转让、公开披露个人信息   （一）个人信息的共享、转让</Text>
          <WhiteSpace />
          <Text>
            我们不会向第三方共享、转让您的个人信息，除非经过您本人事先授权同意，或者共享、转让的个人信息是去标识化处理后的信息，且共享第三方无法重新识别此类信息的自然人主体。
          </Text>
          <WhiteSpace />
          <Text>1.在下列情况下，我们可能会共享的个人信息</Text>
          <WhiteSpace />
          <Text>（1）为实现程序化广告推送，我们可能会与广告合作伙伴共享去标识化或匿名化处理后的信息</Text>
          <WhiteSpace />
          <Text>
            我们可能与委托我们进行推广和广告投放的合作伙伴共享信息，但我们不会分享用于识别您个人身份的信息，例如您的姓名、身份证号等，仅会向这些合作伙伴提供难以识别您个人身份的用户画像标签及去标识化或匿名化后的统计类信息，以帮助其在不识别您个人身份的前提下提升广告有效触达率。
          </Text>
          <WhiteSpace />
          <Text>（2）为实现特定功能而与业务合作伙伴共享</Text>
          <WhiteSpace />
          <Text>
            当软件服务提供商、智能设备提供商或系统服务提供商与我们联合为您提供服务时，例如您需要使用地理位置功能时，为实现这一功能，我们可能会收集您的位置信息及相关设备信息（例如硬件型号、操作系统版本号、国际移动设备身份识别码（IMEI）、网络设备硬件地址（MAC））经过去标识化后并提供给前述提供商。您可以拒绝提供此类信息，但不影响您使用其他服务。
          </Text>
          <WhiteSpace />
          <Text>（3）帮助您参加营销推广活动</Text>
          <WhiteSpace />
          <Text>
            当您选择参加我们举办的有关营销活动时，根据活动需要您可提供姓名、通信地址、联系方式、银行账号等信息，以便第三方能及时向您提供奖品。当您选择参加我们举办的有关营销活动时，根据活动需要您可提供姓名、通信地址、联系方式、银行账号等信息。经过您的明示同意，我们会将上述信息与第三方共享，以便我们能委托第三方及时向您提供奖品。
          </Text>
          <WhiteSpace />
          <Text>2.对共享个人信息第三方主体的谨慎评估及责任约束</Text>
          <WhiteSpace />
          <Text>
            （1）经您同意，我们只会与第三方共享实现目的所必要的信息。如果第三方因业务需要，确需超出前述授权范围使用个人信息的，该第三方将需再次征求您的同意。
          </Text>
          <WhiteSpace />
          <Text>
            （2）对我们与之共享您个人信息的第三方，该些第三方会与我们签订保密协议。同时，我们会对其数据安全能力与环境进行评估并要求第三方以不低于本隐私政策所要求的保密和安全措施来处理该些信息。
          </Text>
          <WhiteSpace />
          <Text>3.收购、兼并、重组时个人信息的转让</Text>
          <WhiteSpace />
          <Text>
            随着我们业务的持续发展，我们将有可能进行合并、收购、资产转让，您的个人信息有可能因此而被转移。在发生前述变更时，我们将按照法律法规及不低于本隐私政策所要求的安全标准继续保护或要求个人信息的继受方继续保护您的个人信息，否则我们将要求继受方重新征得您的授权同意。
          </Text>
          <WhiteSpace />
          <Text>（二）个人信息的公开披露</Text>
          <WhiteSpace />
          <Text>
            除对违规账号、欺诈行为进行处罚公告时，我们会披露相关账号的必要信息外，我们不会公开披露您的信息，除非遵循国家法律法规规定或者获得您的同意。我们公开披露您的个人信息会采用符合行业内标准的安全保护措施。
          </Text>
          <WhiteSpace />
          <Text>（三）依法豁免征得同意共享、转让、公开披露的个人信息</Text>
          <WhiteSpace />
          <Text>
            请您理解，在下列情形中，根据法律法规及国家标准，我们共享、转让、公开披露您的个人信息无需征得您的授权同意{' '}
          </Text>
          <WhiteSpace />
          <Text>（1）与国家安全、国防安全直接相关的。 （2）与公共安全、公共卫生、重大公共利益直接相关的。</Text>
          <WhiteSpace />
          <Text>（3）与犯罪侦查、起诉、审判和判决执行等直接相关的。</Text>
          <WhiteSpace />
          <Text>（4）出于维护您或其他个人的生命、财产等重大合法权益但又很难得到您的同意的。</Text>
          <WhiteSpace />
          <Text>（5）您自行向社会公众公开的个人信息。</Text>
          <WhiteSpace />
          <Text>（6）从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。</Text>
          <WhiteSpace />
          <Text>
            五、我们如何保护个人信息安全   我们非常重视个人信息安全，并采取一切合理可行的措施，保护您的个人信息：{' '}
          </Text>
          <WhiteSpace />
          <Text>（一）数据安全技术措施</Text>
          <WhiteSpace />
          <Text>
            我们会采用符合业界标准的安全防护措施，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问使用、修改,避免数据的损坏或丢失。
          </Text>
          <WhiteSpace />
          <Text>
            我们会使用不低于行业同行的加密技术、匿名化处理等合理可行的手段保护您的个人信息，并使用安全保护机制防止您的个人信息遭到恶意攻击。
          </Text>
          <WhiteSpace />
          <Text>
            “晋日达”的网络服务采取了传输层安全协议等加密技术，通过https等方式提供浏览服务，确保用户数据在传输过程中的安全。
          </Text>
          <WhiteSpace />
          <Text>
            “晋日达”采取加密技术对用户个人信息进行加密保存，并通过隔离技术进行隔离。在个人信息使用时，例如个人信息展示、个人信息关联计算，我们会采用包括内容替换、SHA256在内多种数据脱敏技术增强个人信息在使用中安全性。
          </Text>
          <WhiteSpace />
          <Text>“晋日达”采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。</Text>
          <WhiteSpace />
          <Text>“晋日达”采用代码安全自动检查、数据访问日志分析技术进行个人信息安全审计。</Text>
          <WhiteSpace />
          <Text>（二）“晋日达”为保护个人信息采取的其他安全措施</Text>
          <WhiteSpace />
          <Text>
            1、“晋日达”通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范来管理规范个人信息的存储和使用。“晋日达”通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。我们还会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
          </Text>
          <WhiteSpace />

          <Text>
            2、我们仅允许有必要知晓这些信息的“晋日达”及“晋日达”关联方的员工、合作伙伴访问个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与“晋日达”的合作关系。
          </Text>
          <WhiteSpace />

          <Text>
            3、我们会采取一切合理可行的措施，确保未收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
          </Text>
          <WhiteSpace />
          <Text>4、安全事件处置</Text>
          <WhiteSpace />
          <Text>
            在通过“晋日达”网站和“晋日达”APP与第三方进行网上商品或服务的交易时，您不可避免的要向交易对方或潜在的交易对方披露自己的个人信息，如联络方式或者邮政地址等。请您妥善保护自己的个人信息，仅在必要的情形下向他人提供。
          </Text>
          <WhiteSpace />

          <Text>
            （三）尽管已经采取了上述合理有效措施，并已经遵守了相关法律规定要求的标准，但请您理解，由于技术的限制以及可能存在的各种恶意手段，在互联网行业，即便竭尽所能加强安全措施，也不可能始终保证信息百分之百的安全，我们将尽力确保您提供给我们的个人信息的安全性。您知悉并理解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的因素而出现问题。因此，我们强烈建议您采取积极措施保护个人信息的安全，包括但不限于使用复杂密码、定期修改密码、不将自己的账号密码等个人信息透露给他人。
          </Text>
          <WhiteSpace />

          <Text>
            （四）我们会制定应急处理预案，并在发生用户信息安全事件时立即启动应急预案，努力阻止该等安全事件的影响和后果扩大。一旦发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已经采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以推送通知、邮件、信函、短信等形式告知您，难以逐一告知时，我们会采取合理、有效的方式发布公告。同时，我们还将按照相关监管部门要求，上报用户信息安全事件的处置情况。
          </Text>
          <WhiteSpace />

          <Text>
            （五）我们谨此特别提醒您，本隐私政策提供的个人信息保护措施仅适用于“晋日达”软件及相关服务。一旦您离开“晋日达”及相关服务，浏览或使用其他网站、服务及内容资源，我们即没有能力及义务保护您在“晋日达”软件及相关服务之外的软件、网站提交的任何个人信息，无论您登录、浏览或使用上述软件、网站是否基于“晋日达”的链接或引导。
          </Text>
          <WhiteSpace />

          <Text>
            （六）如果您对我们的个人信息保护有任何疑问，可通过本政策最下方约定的联系方式联系我们。如您发现自己的个人信息泄密，尤其是您的账户及密码发生泄露，请您立即通过本政策最下方（第十条如何联系我们）约定的联系方式联络我们，以便我们采取相应措施。
          </Text>
          <WhiteSpace />
          <Text>六、您如何管理您的个人信息</Text>
          <WhiteSpace />
          <Text>
            我们非常重视您对个人信息的管理，并尽全力保护您对于您个人信息的访问、修改（更新或更正）、删除以及撤回授权同意的权利，以使您有能力保障您的隐私和安全。
          </Text>
          <WhiteSpace />

          <Text>
            当您完成“晋日达”的账号注册、登录并进行合理和必要的身份验证后，您可以查阅、修改、删除您提交给“晋日达”软件及相关服务的个人信息（包括删除您已经发布的评论、投诉建议，修改昵称、头像等）。
          </Text>
          <WhiteSpace />

          <Text>
            一般情况下，您可以直接删除您发布添加的内容，但出于安全性和身份识别的考虑，您可能无法自主修改注册时提交的某些初始注册信息（如实名认证后信息）；如您确有必要修改该类信息，请您通过电子邮件（nengxin@thundersdata.com）联系我们，公司将尽快审核所涉问题，并由专人验证您的用户身份后及时予以回复。
          </Text>
          <WhiteSpace />
          <Text>（一）访问、更正、删除您的个人信息</Text>
          <WhiteSpace />
          <Text>您有权访问您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式自行访问您的个人信息；</Text>
          <WhiteSpace />
          <Text>
            账号信息——如果您希望访问或编辑您的账号中的个人基本资料信息和支付信息、账号信息（身份认证信息除外）、账号绑定信息、更改您的密码、添加安全信息或关闭您的账号等，您可以通过登录“晋日达”账号通过“我的”执行此类操作。
          </Text>
          <WhiteSpace />
          <Text>
            地址信息——您可以通过访问“晋日达”页面上的“发票”—“收货地址”或“我的地址”中随时添加、更改、删除您的收货地址信息（包括收货人姓名、性别、收货地址、电话号码等）。
          </Text>
          <WhiteSpace />
          <Text>查看搜索浏览信息——您可以在“晋日达”中访问或清除您的查看搜索历史记录以及管理其他数据。</Text>
          <WhiteSpace />
          <Text>
            订单信息——您可以在“购买记录”“我的转让”中查阅或清除您的订单记录、交易记录等。您可以选择删除已完成的订单信息，但这样可能导致我们无法根据您的购买信息而准确提供相应的售后服务。
          </Text>
          <WhiteSpace />
          <Text>
            如果您无法通过上述链接管理这些个人信息，您可以随时可以通过“投诉建议”微博、微信公众号、电话、邮箱联系我们的客服。我们将在三十天内回复您的访问请求。
          </Text>
          <WhiteSpace />
          <Text>（二）、删除您的个人信息   您可以通过“（一）访问您的个人信息”中列明的方式删除您的部分个人信息。</Text>
          <WhiteSpace />
          <Text>在以下情形中，您可以向我们提出删除个人信息的请求： （1）如果我们处理个人信息的行为违反法律法规。</Text>
          <WhiteSpace />
          <Text>
            （2）如果我们收集、使用您的个人信息，却未征得您的同意。 （3）如果我们处理个人信息的行为违反了与您的约定。
          </Text>
          <WhiteSpace />
          <Text>
            （4）如果您不再使用我们的产品或服务，或您主动注销了账号。 （5）如果我们永久不再为您提供产品或服务。
          </Text>
          <WhiteSpace />
          <Text>
            若我们决定响应您的删除请求，我们还将同时通知从我们获得您的个人信息的实体，要求其及时删除，除非法律法规另有规定，或这些实体获得您的独立授权。当您从我们的服务中删除信息后，我们可能不会立即备份系统中删除相应的信息，但会在备份更新时删除这些信息。
          </Text>
          <WhiteSpace />
          <Text>（三）、改变您授权同意的范围或撤回您的授权</Text>
          <WhiteSpace />
          <Text>
            您可以通过删除信息、关闭设备功能、在手机中进行隐私设置等方式改变您授权我们继续收集个人信息的范围或撤回您的授权。您也可以通过注销账户的方式，撤回我们继续收集您个人信息的全部授权。
          </Text>
          <WhiteSpace />

          <Text>
            请您理解，每个业务功能需要一些基本的个人信息才能得以完成，当您撤回同意或授权后，我们无法继续为您提供撤回同意或授权所对应的服务，也不再处理您相应的个人信息。但您撤回同意或授权的决定，不会影响此前基于您的授权而开展的个人信息处理。
          </Text>
          <WhiteSpace />
          <Text>（四）个人信息主体注销账号</Text>
          <WhiteSpace />
          <Text>
            您有权注销您的“晋日达”账户，您可以通过访问：“晋日达”App页面上的“投诉建议”中进行注销账户申请；或者拨打我们的客服电话“0571-26270118”进行协助注销。您注销成功后，我们将根据法律法规的要求尽快删除您的个人信息或作匿名化处理。
          </Text>
          <WhiteSpace />

          <Text>
            一旦您注销“晋日达”账号，将无法使用“晋日达”产品的服务，因此请您谨慎操作。我们为了保护您或他人的合法权益会结合您对“晋日达”产品的使用情况判断是否支持您的注销请求。例如若您在“晋日达”里有未提现的电费或您还有未结算的电费收入，则我们不会立即支持您的请求。除法律法规另有规定外，注销帐号之后我们将停止为您提供产品和服务，并根据您的要求删除您的个人信息。您通过第三方帐号（如微信、微博、QQ等）授权登录“晋日达”时，需要向第三方申请注销账号或取消关联。
          </Text>
          <WhiteSpace />
          <Text>（五）、如果您不想接受我们给您发送的促销信息，您随时可通过以下方式取消：</Text>
          <WhiteSpace />
          <Text>
            在某些业务功能中，我们可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害“晋日达”商业秘密或其他用户权益、社会公共利益的前提下提供申诉方法。
          </Text>
          <WhiteSpace />
          <Text>（1）您可以随时回复“TD”来取消我们给您发送的手机促销短信。</Text>
          <WhiteSpace />
          <Text>（2）您可以通过移动手机“设置-推送消息设置-通知”设置是否接受我们通过“通知”推动给您的商品和促销信息</Text>
          <WhiteSpace />
          <Text>
            （3）您可以通过“晋日达”APP“我的—设置”设置是否接受您可能感兴趣或关注的商品的问答信息和焦点社区的互动信息。
          </Text>
          <WhiteSpace />
          <Text>
            （4）我们会与第三方的平台或媒体（“平台”）合作基于您的个人信息向您推荐个性化的商品。这些个人信息包括诸如在“晋日达”的购物情况、访问“晋日达”关联公司网站的情况以及基于信息系统、算发认为您可能感兴趣的内容。平台在广告窗内设置了屏蔽功能，您可选择屏蔽您不喜欢的广告。如您不愿意接受这些广告的推荐服务，请联系平台进行关闭。您知晓并理解平台是自主经营的实体，“晋日达”无法对其进行管理。
          </Text>
          <WhiteSpace />
          <Text>
            （5）为了保护您的隐私，我们不会以任何方式和途径向您推送涉及宗教信仰、性、疾病等相关敏感内容的促销或商品信息给您。
          </Text>
          <WhiteSpace />
          <Text>（六）提前获知产品和服务停止运营权。</Text>
          <WhiteSpace />
          <Text>
            “晋日达”愿一直陪伴您，若因特殊原因导致“晋日达”产品和服务被迫停止运营，我们将提前15日在产品或服务的主页面或站内信或向您发送短信、电子邮件或其他合适的能触达您的方式通知您，并将停止对您个人信息的收集，同时会按照法律规定对所持有的您的个人信息进行删除或匿名化处理等。为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。我们将在三十天内做出答复。
          </Text>
          <WhiteSpace />
          <Text>（七）响应您的上述请求</Text>
          <WhiteSpace />
          <Text>
            如果您无法通过上述方式访问、更正或删除您的个人信息，或您需要访问、更正或删除您在使用我们产品与/或服务时所产生的其他个人信息，或您认为“晋日达”存在任何违反法律法规或与您关于个人信息的收集或使用的约定，您均可以发送电子邮件至nengxin@thundersdata.com或其它方式与我们联系。为了保障安全，我们可能需要您提供书面请求，或以其他方式证明您的身份，我们将在收到您反馈并验证您的身份后的三十天内答复您的请求。对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝。
          </Text>
          <WhiteSpace />
          <Text>在以下情形中，按照法律法规要求，我们将无法响应您的请求： （1）与国家安全、国防安全有关的。</Text>
          <WhiteSpace />
          <Text>（2）与公共安全、公共卫生、重大公共利益有关的。 （3）与犯罪侦查、起诉和审判等有关的。</Text>
          <WhiteSpace />
          <Text>（4）有充分证据表明您存在主观恶意或滥用权利的。</Text>
          <WhiteSpace />
          <Text>（5）响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。 （6）涉及商业秘密的。  </Text>
          <WhiteSpace />
          <Text>七、未成年人条款</Text>
          <WhiteSpace />
          <Text>
            若您是未满18周岁的未成年人，在使用“晋日达”软件及相关服务前，应在您的父母或其他监护人监护、指导下共同阅读并同意本隐私政策。
          </Text>
          <WhiteSpace />

          <Text>
            我们根据国家相关法律法规的规定保护未成年人的个人信息，只会在法律允许、父母或其他监护人明确同意或保护未成年人所必要的情况下收集、使用、共享或披露未成年人的个人信息；如果我们发现在未事先获得可证实的父母同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关信息。
          </Text>
          <WhiteSpace />

          <Text>
            若您是未成年人的监护人，当您对您所监护的未成年人的个人信息有相关疑问时，请通过本隐私政策公示的联系方式与我们联系。
          </Text>
          <WhiteSpace />
          <Text>八、隐私政策的修订和通知</Text>
          <WhiteSpace />
          <Text>
            （一）为了给您提供更好的服务，“晋日达”软件及相关服务将不时更新与变化，我们会适时对本隐私政策进行修订，该等修订构成本隐私政策的一部分并具有等同于本隐私政策的效力。但未经您明确同意，我们不会削减您依据当前生效的本隐私政策所应享受的权利。
          </Text>
          <WhiteSpace />

          <Text>
            （二）本隐私政策更新后，我们会在“晋日达”应用程序客户端和官方网站发出更新版本，并在更新后的条款生效前以适当的方式提醒您更新的内容，以便您及时了解本隐私政策的最新版本。如您继续使用我们的服务，表示同意接受修订后的本政策的内容，但是如果更新的内容需要采集音视频、获取您通讯录、联系方式、地理位置等个人敏感信息，仍会再次以显著方式征求您的同意。
          </Text>
          <WhiteSpace />

          <Text>
            （三）对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于邮件、短信、私信或在浏览页面做特别提示等方式，说明隐私政策的具体变更内容）。
          </Text>
          <WhiteSpace />
          <Text>本隐私政策所指的重大变更包括但不限于：</Text>
          <WhiteSpace />
          <Text>1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等；</Text>
          <WhiteSpace />
          <Text>2.我们在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有变更等；</Text>
          <WhiteSpace />
          <Text>
            3.个人信息共享、转让或公开披露的主要对象发生变化； 4.您参与个人信息处理方面的权利及其行使方式发生重大变化；
          </Text>
          <WhiteSpace />
          <Text>5.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时。   九、适用范围</Text>
          <WhiteSpace />
          <Text>
            本隐私权政策适用于由杭州能信科技有限公司及其关联方提供的所有服务，包括“晋日达”APP客户端、网站等，不适用于有单独的隐私权政策且未纳入本隐私权政策的第三方产品或服务。
          </Text>
          <WhiteSpace />
          <Text>本隐私权政策不适用于：</Text>
          <WhiteSpace />
          <Text>
            1.其他第三方产品或服务，可能包括在向您显示的产品或网站和广告内容或者“晋日达”服务中链接到的其他产品或网站；{' '}
          </Text>
          <WhiteSpace />
          <Text>2.为“晋日达”服务进行广告宣传的其他第三方。</Text>
          <WhiteSpace />
          <Text>
            您使用这些第三方服务（包括您向这些第三方提供的任何个人信息），将受这些第三方的服务条款及隐私政策约束（而非本隐私政策），具体规定请您仔细阅读第三方的条款。请您妥善保护自己的个人信息，仅在必要的情况下向第三方提供。
          </Text>
          <WhiteSpace />

          <Text>
            本隐私政策中所述的“晋日达”及相关服务有可能会根据您所使用的手机型号、系统版本、软件应用程序版本等因素而有所不同。最终的产品和服务以您所使用的“晋日达”软件及相关服务为准。
          </Text>
          <WhiteSpace />

          <Text>
            如对本隐私政策内容有任何疑问、意见或建议，您可通过登录“晋日达”APP客户端内的“投诉建议”页面或发送邮件至nengxin@thundersdata.com与我们联系。
          </Text>
          <WhiteSpace />
          <Text>十、如何联系我们</Text>
          <WhiteSpace />
          <Text>
            如果您对本隐私政策有任何意见或问题，或者您对“晋日达”收集、使用或披露您的个人信息有任何问题，请通过下列方式联系我们，并提及“隐私政策”；
          </Text>
          <WhiteSpace />

          <Text>
            （一）如您对本隐私政策或您个人信息的相关事宜有任何问题、意见或建议，您可以通过新浪微博：晋日达、微信公众号：晋日达，以及“晋日达”APP客户端（投诉建议）或发送邮件至nengxin@thundersdata.com或拨打我们的客服电话等多种方式与我们联系。
          </Text>
          <WhiteSpace />
          <Text>（二）通信地址 杭州能信科技有限公司 浙江省杭州市余杭区文一西路1378号杭州师范大学科技园E幢1506</Text>
          <WhiteSpace />
          <Text>电话：0571-26270118 邮政编码 310000</Text>
          <WhiteSpace />
          <Text>
            一般情况下，我们将在三十天内回复。如果您对我们的回复不满意，特别是我们的个人信息处理行为损害了您的合法权益，您还可以向网信、电信、公安及工商等监管部门进行投诉或举报。您还可以通过向被告住所地有管辖权的法院提起诉讼。
          </Text>
          <WhiteSpace />

          <Text>
            为保障我们高效处理您的问题并及时向您反馈，需要您提交身份证明、有效联系方式和书面请求及相关证据，我们会在验证您的身份处理您的请求。
          </Text>
          <WhiteSpace />
          <Text>十一、其他</Text>
          <WhiteSpace />
          <Text>（一）本“隐私政策”中的标题仅为方便及阅读而设，并不影响本《隐私政策》中任何规定的含义或解释。</Text>
          <WhiteSpace />
          <Text>（二）本“隐私政策”相关词语释义：</Text>
          <WhiteSpace />
          <Text>
            1.“晋日达”软件及相关服务是指公司及其关联方通过合法拥有并运营的、标注名称为“晋日达”的APP客户端应用程序以及“晋日达”官方网站（www.genergydata.com），向您提供的产品与服务。
          </Text>
          <WhiteSpace />

          <Text>
            2. 关联方是指，指一方现在或将来控制、受控制或与其处于共同控制下的任何公司、机构以及上述公司或机构的法定代表人。“控制”是指直接或间接地拥有影响所提及公司管理的能力，无论是通过所有权、有投票权的股份、合同或其他被依法认定的方式。
          </Text>
          <WhiteSpace />

          <Text>
            3. 个人信息是指，以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，包括个人身份信息（姓名、出生日期、身份证件号码，包括身份证、军官证、护照、驾驶证）、面部特征、地址、联系电话、通信录、网络身份识别信息（包括账号名、账号昵称、邮箱地址以及与前述有关的密码与密码保护问题和答案）；财产信息、交易信息、个人上网记录（网络浏览记录、点击记录等）、个人常用设备信息（包括硬件型号、设备MAC地址、操作系统类型、软件列表唯一设备识别码等在内的描述个人常用终端设备基本情况的信息）、个人位置信息等。
          </Text>
          <WhiteSpace />

          <Text>
            4. 个人敏感信息是指，一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策中的个人敏感信息包括：包括个人身份信息（身份证件号码，包括身份证、军官证、护照、驾驶证）、面部识别特征；财产信息、交易信息；网络身份识别信息（包括账号名、账号昵称、邮箱地址以及与前述有关的密码与密码保护问题和答案）；其他信息（包括通信录、个人电话号码、行程信息、精准定位信息）。
          </Text>
          <WhiteSpace />
          <Text>
            5.去标识化是指，通过对个人信息的技术处理，使其在不借助额外信息的情况下，无法识别个人信息主体的过程。{' '}
          </Text>
          <WhiteSpace />
          <Text>
            6.匿名化是指，通过对个人信息的技术处理，使得个人信息主体无法被识别，且处理后的信息不能被复原的过程。{' '}
          </Text>
          <WhiteSpace />
          <Text>
            （三）本“隐私政策”的版权为“晋日达”（杭州能信科技有限公司）所有，在法律允许的范围内，我们拥有解释和修改的权利。
          </Text>
          <WhiteSpace />
          <Text>感谢您花时间了解我们的隐私政策！ 档铺网——在线文档免费处理</Text>
          <WhiteSpace />
        </WingBlank>
      </ScrollView>
    </Container>
  );
}
