import { WingBlank, WhiteSpace, Flex, Text } from '@td-design/react-native';
import { ScrollView } from 'react-native';
import { Container } from 'components';

export function UserAgreement() {
  return (
    <Container>
      <ScrollView>
        <WingBlank>
          <WhiteSpace />
          <Flex justifyContent="center">
            <Text variant="h1">用户注册协议（个人）</Text>
          </Flex>
          <WhiteSpace />
          <Text>版本日期：2019/6/15</Text>
          <WhiteSpace />
          <Text>
            欢迎阅读晋日达用户注册协议(下称“本协议”或“注册协议”)。本协议双方为杭州晋日达科技有限公司（以下简称“晋日达”或“本公司”、“我公司”）与晋日达用户（自然人用户，简称“用户”或“您”），本协议具有合同效力。本协议与晋日达《平台服务协议》互为补充，二者如有冲突，以晋日达《平台服务协议》为准，请您在接受本平台服务前务必审慎阅读。
          </Text>
          <WhiteSpace />
          <Text>一、 接受条款</Text>
          <WhiteSpace />
          <Text>
            晋日达有权根据法律法规、监管政策或业务发展需求等原因，对本协议内容进行修改、增加或删减，晋日达将按照法律规定以网页公告、App推送、电子邮件、短信等方式对该等变更提前予以公示、通知，晋日达也将提供渠道供用户充分表达修改意见。公示期满，晋日达将变更相关条款自以上述变更公告、通知之日起生效。若您在本协议变更的条款生效后，仍继续使用本服务的，则视为您已认真阅读、充分理解并同意接受该等变更；如果您不接受修改后的协议，应当停止使用晋日达提供的软件或服务。
          </Text>
          <WhiteSpace />
          <Text>二、定义</Text>
          <WhiteSpace />
          <Text>
            1、用户及用户注册：
            用户必须是中国境内具备完全民事行为能力的自然人。无民事行为能力人、限制民事行为能力人不应当注册为晋日达用户；超过其民事权利或行为能力范围从事信息发布、交易的，其与晋日达之间的注册协议自始无效，晋日达一经发现，有权立即注销该用户，并追究其使用晋日达服务的一切法律责任。用户注册是指用户登陆晋日达，并按要求填写相关信息并确认同意履行相关用户协议的过程。用户因进行信息发布、交易、获取有偿服务或接触晋日达服务器而发生的所有应纳税赋，以及一切硬件、软件、服务及其它方面的费用均由用户负责支付。
          </Text>
          <WhiteSpace />
          <Text>
            2、会员：在晋日达平台上注册的用户成为晋日达会员。晋日达系利用区块链技术为资金提供方和光伏电站运营方提供信息对接、交易撮合服务等其他服务的信息服务平台。晋日达会对注册用户的身份信息真实性进行审核但不能完全控制双方交易所涉及的服务的质量、安全或合法性，信息的真实性或准确性。晋日达仅作为居间服务方，并不作为接受服务方或是提供服务方的身份参与用户行为的本身。晋日达提醒用户应该通过自己的谨慎判断确定服务及相关信息的真实性、合法性和有效性，并承担电站份额认购行为过程中的风险。
          </Text>
          <WhiteSpace />
          <Text>
            3、注册义务：您须按照网站提示，真实、准确、完整的填写您的资料；维持并及时更新资料，使其保持真实、准确、完整和反映当前情况。倘若您提供的资料不真实、准确和完整或我公司有合理理由怀疑该资料不真实、准确、完整的，我公司有权暂停或终止您的注册用户身份。注册名、密码在登记过程中，将由您选择。注册名的选择应遵守法律法规及社会公德。您必须对您的密码保密，您将对您注册名和密码下发生的所有活动承担责任。如发现任何人未经您同意使用您的注册名和密码，您须立即通知我公司；对该行为造成的损害，我公司不负任何责任。
          </Text>
          <WhiteSpace />
          <Text>三、您的权利和义务</Text>
          <WhiteSpace />
          <Text>
            1、您有权利拥有在晋日达注册的会员名及登录密码，并有权利使用自己的会员名及密码随时登陆晋日达平台。您不得以任何形式擅自转让或授权他人使用自己的晋日达会员名及密码
          </Text>
          <WhiteSpace />
          <Text>
            2、您有权根据本注册协议的规定以及晋日达上发布的相关规则，利用晋日达平台查询服务信息、开通钱包、提现、参加晋日达的有关活动以及有权享受晋日达提供的其它的有关服务；
          </Text>
          <WhiteSpace />
          <Text>
            3、您在晋日达进行货运订单交易时，可以请求晋日达予以协调。您如发现其他机构有违法或违反本注册协议的行为，可以向晋日达进行反馈和要求处理。如您因网上交易与其他用户发生诉讼的，您有权通过司法部门要求晋日达提供相关资料；
          </Text>
          <WhiteSpace />
          <Text>4、您同意遵守晋日达的平台各项规则，接收来自晋日达或晋日达合作伙伴发出的邮件或信息；</Text>
          <WhiteSpace />
          <Text>
            5、您应当保证在使用晋日达平台进行信息发布过程中遵守诚实信用的原则，发布的信息中不得包含有反动、暴力、淫秽、毒品、赌博、教唆及有损社会公共道德的内容；不得发布各类违法或违规信息；
          </Text>
          <WhiteSpace />
          <Text>6、您不应在晋日达平台上恶意评价其他用户，或采取不正当手段提高自身的信用度或降低其他用户的信用度；</Text>
          <WhiteSpace />
          <Text>
            7、您在晋日达平台上不得发布国家禁止或限制发布的包含有侵犯他人知识产权或其它合法权益的机密类、隐私类信息，也不得发布违背社会公共利益或公共道德的、或是晋日达认为不适合在晋日达上发布的信息；
          </Text>
          <WhiteSpace />
          <Text>
            8、您承诺在使用晋日达时实施的所有行为均遵守国家法律、法规和晋日达的相关规定以及各种社会公共利益或公共道德。如有违反上述承诺导致任何法律后果的发生，您独立承担所有相应的法律责任；
          </Text>
          <WhiteSpace />
          <Text>
            9、您同意，不对晋日达上任何数据作商业性利用，包括但不限于在未经晋日达事先书面批准的情况下，以复制、传播等方式使用在晋日达网站上展示的任何资料；
          </Text>
          <WhiteSpace />
          <Text>四、晋日达的权利义务</Text>
          <WhiteSpace />
          <Text>1、晋日达有权通过自身或委托其认可的第三方机构为您提供数据统计、信息收集等增值服务；</Text>
          <WhiteSpace />
          <Text>
            2、晋日达有义务在现有技术上维护整个网上平台的正常运行，并努力提升和改进技术。对于您在注册使用晋日达平台中所遇到的与信息发布或注册有关的问题及反映的情况，晋日达应及时作出回复；
          </Text>
          <WhiteSpace />
          <Text>
            3、对于您在晋日达平台上的不当行为或其它任何晋日达认为应当终止服务的情况，晋日达有权随时作出删除相关信息、终止服务提供等处理，而无须征得您的同意；
          </Text>
          <WhiteSpace />
          <Text>4、因网上平台的特殊性，晋日达仅对会员的注册资料、行为及其他事项进行形式审查；</Text>
          <WhiteSpace />
          <Text>
            5、您在晋日达进行电站份额认购交易过程中如与其它用户产生纠纷，请求晋日达予以协调，经晋日达审核后，晋日达有权通过电子邮件联系纠纷双方了解情况，并将所了解的情况通过电子邮件互相通知对方；
          </Text>
          <WhiteSpace />
          <Text>
            6、您因在晋日达平台上进行电站认购行为而产生纠纷继而发生诉讼的，您可以通过司法部门或行政部门依照法定程序要求晋日达提供相关数据，晋日达应积极配合并提供有关资料；
          </Text>
          <WhiteSpace />
          <Text>
            7、晋日达有权对您的注册数据及信息发布行为进行查阅，发现注册数据或信息发布行为中存在任何问题或怀疑，均有权向您发出询问及要求改正的通知或者直接作出删除等处理；
          </Text>
          <WhiteSpace />
          <Text>
            8、在您使用晋日达服务时，晋日达有权接收并记录您的个人信息，包括但不限于IP地址、网站Cookie中的资料及您要求取用的网页记录等；
          </Text>
          <WhiteSpace />
          <Text>
            9、晋日达有权委托具有资质的银行为您提供资金存管（监管）服务，若您不同意晋日达委托银行的有关开户或使用协议，您将无法享受晋日达平台提供的部分或全部服务。
          </Text>
          <WhiteSpace />
          <Text>五、免责声明</Text>
          <WhiteSpace />
          <Text>您将对您发布的信息及其他在晋日达上发生的任何行为承担责任，我公司对此不负任何责任。</Text>
          <WhiteSpace />
          <Text>六、不可抗力</Text>
          <WhiteSpace />
          <Text>
            对于因晋日达合理控制范围以外的原因，包括但不限于自然灾害、罢工或骚乱、物质短缺或定量配给、暴动、战争行为、政府行为、通讯或其他设施故障或严重伤亡事故等，致使晋日达延迟或未能履约的，晋日达不对您承担任何责任。
          </Text>
          <WhiteSpace />
          <Text>七、其他</Text>
          <WhiteSpace />
          <Text>
            若您和晋日达之间发生任何纠纷或争议，首先应友好协商解决；协商不成的，因本协议的履行、签订均发生于互联网，您同意将纠纷或争议提交杭州互联网法院诉讼解决。
          </Text>
        </WingBlank>
      </ScrollView>
    </Container>
  );
}
